# CwpLinkedRoomPhases Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CwpLinkedRoomPhases Property
ParameterTypeId Class See Also
---
"Phases"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CwpLinkedRoomPhases { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CwpLinkedRoomPhases As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CwpLinkedRoomPhases {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace